const ntt = (number, type) => {
    const numberList1 = {
        "1" : "اول",
        "2" : "دوم",
        "3" : "سوم",
        "4" : "چهارم",
        "5" : "پنجم",
        "6" : "ششم",
        "7" : "هفتم",
        "8" : "هشتم",
        "9" : "نهم",
        "10" : "دهم",
        "11" : "یازدهم",
        "12" : "دوازدهم"
    }

    const numberList2 = {
        "1" : "یک",
        "2" : "دو",
        "3" : "سه",
        "4" : "چهار",
        "5" : "پنج",
        "6" : "شش",
        "7" : "هفت",
        "8" : "هشت",
        "9" : "نه",
        "10" : "ده",
        "11" : "یازده",
        "12" : "دوازده"
    }

    return (type == 1) ? numberList1[number] : numberList2[number]
}

module.exports = ntt